[
{"id":0, "title":"Digital Marketing Sales", "avaPos":1, "employer":"Dubyts Communications Inc.", "openDate":"2014-01-08", "closeDate":"2014-01-24 23:59", "jobDesc":"- This role will be primarily focused on identifying, cultivating, and closing opportunities with a variety of different types of businesses in Canada\n\n- Work with key decision makers to understand their initiatives in developing integrated marketing solutions and matching our products to their needs\n- Create and deliver powerful and persuasive presentations to key decision makers\n- Lead the development of client contract negotiations through the close or renewal of business\n- Manage Prospect/Client database\nKey Skills:\n- Strong verbal/written communication and presentation skills\n- Well-developed technical skills (MS Office, CRM)\n- Able to manage deadlines and to operate with a sense of urgency\n- Strong understanding of digital media platforms\n- Must be highly organized and work effectively in a fast-paced, deadline-driven, environment\n- Must be results oriented and have a record of success working in a goal-oriented, highly accountable environment", },
{"id":1, "title":"DATA ENTRY", "avaPos":1, "employer":"Gamma-Dynacare Medical Laboratories", "openDate":"2014-01-10", "closeDate":"2014-01-24 23:59", "jobDesc":"JOB POSTING \nPOSITION TITLE:  DATA ENTRY\n\nJOB POSTING CODE: WPG2014 -010\n\nLOCATION(S):    King Edward – 100-830 King Edward St\n\nCLASSIFICATION: Full-time, Term (undefined length of term)\n\nWORKING SCHEDULE: Monday – Friday 10:00 am -7:00 pm\n(1 hour lunch)\n(40 hours per week)\n\nMANDATE:\n\nAccurately entering patient demographics and test information into the computer system.\n\nKEY ACCOUNTABILITIES:\n\n    The accurate entry and verification of all the information as it appears on the requisition in a timely manner.  \n    Verification of specialized client requisitions are performed on a daily basis.\n    Routine disinfecting of work area and equipment is to be completed on a scheduled basis. \n    Responsible to protect their Health and Safety by reporting hazards and working in compliance with established safe working practices. \n    Performing duties in accordance with Company policies and procedures.\n    Image all requisitions, remove any unsigned requisitions and prepare for mailing as required\n    Department head, Managers, Senior Laboratory Assistant, clinical staff and co-workers, clients both internal and external contacts.\n    Responsible to preserve and safeguard all confidential information that comes to their knowledge in the course of employment with Gamma-Dynacare Medical Laboratories.\n    Responsible to observe and comply with the policies of the company and applicable legal requirements with respect to confidential information and the protection of privacy.\n    Responsible to follow all relevant pre and/or post analytical QA protocols as described in the company QA manual.\n    Contribute towards Gamma-Dynacare Medical Laboratory's learning and knowledge based culture by sharing in the responsibility of training and skill development of new team members as requested.\n\nSKILLED KNOWLEDGE REQUIREMENTS:\n    Secondary School\n    Previous related experience required to perform the job\nTO APPLY:\n\nTo apply for this position please submit an updated resume with a one page cover letter outlining in detail your qualifications and place JOB POSTING CODE number in the subject line no later than January 24, 2014  Please submit applications to our Human Resources Department at molinskij@gamma-dynacare.com.\nDedicated to Employment Equity", }
]